## Terraform Plan Output
<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.goodbye_world_lambda.aws_lambda_function.lambda_function will be created
  + resource "aws_lambda_function" "lambda_function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "modules/lambda/GoodbyeWorldLambda.zip"
      + function_name                  = "GoodbyeWorldLambda"
      + handler                        = "main.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::866934333672:role/GoodbyeWorldLambda-exec-role"
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "F6jgsikh2MF0MZCDeJ0CYjtb2ex2mRKNRdA4d2Rx2Yw="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "ManagedBy" = "Terraform"
          + "Project"   = "Example"
        }
      + tags_all                       = {
          + "ManagedBy" = "Terraform"
          + "Project"   = "Example"
        }
      + timeout                        = 10
      + version                        = (known after apply)
    }

  # module.hello_world_lambda.aws_lambda_function.lambda_function will be created
  + resource "aws_lambda_function" "lambda_function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "modules/lambda/HelloWorldLambda.zip"
      + function_name                  = "HelloWorldLambda"
      + handler                        = "main.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::866934333672:role/HelloWorldLambda-exec-role"
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "Rd4dhASXTRyVMyb6ilvxZk3PCV6iX4imMe0OjyJy5kg="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "ManagedBy" = "Terraform"
          + "Project"   = "Example"
        }
      + tags_all                       = {
          + "ManagedBy" = "Terraform"
          + "Project"   = "Example"
        }
      + timeout                        = 10
      + version                        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + goodbye_world_lambda_arn = (known after apply)
  + hello_world_lambda_arn   = (known after apply)

```
</details>